Tekla.Structures.Drawing.UI.DrawingObjectSelector.SelectorTypes
Types of selector. Who else besides sonar needs such ducumentation!

Tekla.Structures.Drawing.UI.DrawingObjectSelector.SelectorTypes.NewSelection
NewSelection

Tekla.Structures.Drawing.UI.DrawingObjectSelector.SelectorTypes.ExtendSelection
ExtendSelection

Tekla.Structures.Drawing.UI.DrawingObjectSelector.SelectorTypes.ReduceSelection
ReduceSelection

Tekla.Structures.Drawing.UI.DrawingObjectSelector.SelectorTypes.UnselectAll
UnselectAll

Tekla.Structures.Drawing.UI.DrawingObjectSelector.SelectorTypes.NewSelectionExtraHighLight
NewSelectionExtraHighLight

Tekla.Structures.Drawing.UI.DrawingObjectSelector.SelectorTypes.ExtendSelectionExtraHighLight
ExtendSelectionExtraHighLight